app/views/orders/_line_item_fields.html.erb

SELECT "products".* FROM "products"
---
    <%= f.label :product %><br>
    <%= f.collection_select :product_id, Product.all, :id, :name, prompt: true,  :class => 'form-control' %>