app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("address", "created_at", "name", "payment_method", "status", "surname", "town", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)