app/controllers/products_controller.rb

INSERT INTO "products" ("added_at", "amount", "created_at", "description", "maker", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		@product = Product.new(params[:product].permit(:name, :description, :added_at, :maker, :amount))
		if @product.save